namespace SumyCRM.Services
{
    public class CategoryConverter
    {
        public static readonly Dictionary<string, Guid> MenuToCategory = new()
        {
            // ================= ТРАНСПОРТ ==================
            ["1.2"] = Guid.Parse("0722954c-c775-4b56-9f4c-dca6ba72aee5"),
            ["1.3"] = Guid.Parse("0722954c-c775-4b56-9f4c-dca6ba72aee5"),

            // =================== ВОДА ===================
            ["2.1"] = Guid.Parse("5ef8838e-3264-4277-9604-92b004d97224"),
            ["2.2"] = Guid.Parse("5ef8838e-3264-4277-9604-92b004d97224"),
            ["2.3"] = Guid.Parse("5ef8838e-3264-4277-9604-92b004d97224"),
            ["2.4"] = Guid.Parse("551c7c70-9bc0-434c-b375-90b10e29f60c"),

            // =================== ТЕПЛОПОСТАЧАННЯ ===================
            ["3.1"] = Guid.Parse("913bbc39-41cc-4b03-84ce-d035bd7f2765"),
            ["3.2"] = Guid.Parse("913bbc39-41cc-4b03-84ce-d035bd7f2765"),
            ["3.3"] = Guid.Parse("22e939f1-9f7c-4a25-be1d-f74dea1cebc6"),
            ["3.4"] = Guid.Parse("22e939f1-9f7c-4a25-be1d-f74dea1cebc6"),

            // =================== РОБОТА ЛІФТІВ ===================
            ["4.1"] = Guid.Parse("24b04586-ec5f-44bc-8c22-0698af840230"),

            // =================== ЕНЕРГОПОСТАЧАННЯ ===================
            ["5.1"] = Guid.Parse("6edf1e30-5f41-4e5f-99a8-1500b79f7115"),
            ["5.2"] = Guid.Parse("d3488989-bcef-4033-ad8e-e7fe24374ef1"),
            ["5.3"] = Guid.Parse("6edf1e30-5f41-4e5f-99a8-1500b79f7115"),

            // ========================= ГАЗ ========================
            ["6.1"] = Guid.Parse("e9921303-d624-4da6-8a89-96f8a0407af7"),

            // ====================== РЕМОНТ ========================
            ["7.1"] = Guid.Parse("d5e652f3-4811-4538-8337-f33b21610df3"),
            ["7.2"] = Guid.Parse("d5e652f3-4811-4538-8337-f33b21610df3"),

        };
        public static readonly Dictionary<string, string> MenuToText = new()
        {
            // ================= ТРАНСПОРТ ===================
            ["1.2"] = "Скарга на графік руху",
            ["1.3"] = "Скарга на пільговий проїзд",

            // =================== ВОДА ===================
            ["2.1"] = "Відключення води",
            ["2.2"] = "Порив труби чи залиття",
            ["2.3"] = "Проблема з тиском або якістю води",
            ["2.4"] = "Обслуговування каналізації",

            // =================== ТЕПЛО ===================
            ["3.1"] = "Відсутня гаряча вода",
            ["3.2"] = "Недостатня температура ГВП",
            ["3.3"] = "Проблеми з опаленням",
            ["3.4"] = "Протікання труби гарячої води чи опалення",

            // =================== РОБОТА ЛІФТІВ ===================
            ["4.1"] = "Не працює ліфт",

            // =================== ЕНЕРГОПОСТАЧАННЯ ===================
            ["5.1"] = "Відсутнє енергопостачання в будинку",
            ["5.2"] = "Відсутнє вуличне освітлення",
            ["5.3"] = "Обрив електричних дротів або інші пошкодження",

            // =================== ГАЗ ===================
            ["6.1"] = "Відсутність газопостачання",

            // =================== РЕМОНТ ===================
            ["7.1"] = "Тече покрівля або ливневка",
            ["7.2"] = "Ремонт внутрішньобудинкових конструкцій",
        };

    }
}
